Lenti84/VdMot_Controller/software_esp32/src/stmApp.cpp
/**HEADER*******************************************************************
  project : VdMot Controller

  author : SurfGargano, Lenti84

  Comments:

  Version :

  Modifcations :


***************************************************************************
*
* THIS SOFTWARE IS PROVIDED "AS IS" AND ANY EXPRESSED OR
* IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
* OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
* IN NO EVENT SHALL THE DEVELOPER OR ANY CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
* INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
* (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
* SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
* HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
* STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
* IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
* THE POSSIBILITY OF SUCH DAMAGE.
*
**************************************************************************
  This program is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License.
  See the GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with this program.  If not, see <http://www.gnu.org/licenses/>.

  Copyright (C) 2021 Lenti84  https://github.com/Lenti84/VdMot_Controller

*END************************************************************************/




#include "globals.h"
#include <ArduinoJson.h>
#include <Arduino.h>
#include "stmApp.h"
#include <WiFi.h>
#include <Syslog.h>
#include <WiFiUdp.h>
#include "VdmNet.h"
#include "VdmSystem.h"
#include "VdmConfig.h"
#include "stm32.h"
#include "Queue.h"
#include "Messenger.h"

#define     MAX_CMD_LEN     10
#define     MAX_ARG_LEN     120

static const char* commCmds [] = 
               {APP_PRE_SETTARGETPOS,APP_PRE_GETONEWIRECNT,APP_PRE_GETONEWIREDATA,
                APP_PRE_SETONEWIRESEARCH,APP_PRE_SETALLVLVOPEN,APP_PRE_GETVLVDATA,
                APP_PRE_SETVLLEARN,APP_PRE_GETVERSION,APP_PRE_GETTARGETPOS,
                APP_PRE_SETMOTCHARS,APP_PRE_GETMOTCHARS,APP_PRE_SETVLVSENSOR,
                APP_PRE_GETONEWIRESETT,APP_PRE_SETLEARNMOVEM,APP_PRE_GETLEARNMOVEM,
                APP_PRE_GETVLSTATUS,APP_PRE_SETDETECTVLV,APP_PRE_MATCHSENS,
                APP_PRE_SOFTRESET,NULL};


CStmApp StmApp;

CStmApp::CStmApp() 
{
    settarget_check =false;
    tempIndex=0;
    checkTempsCount = 0;
    cmd_buffer = "";
    found = false;
    bufptr = buffer;
    buflen = 0;
    argcnt = 0;
    arg0ptr = arg0;
	arg1ptr = arg1;
    arg2ptr = arg2;
    arg3ptr = arg3;
    arg4ptr = arg4;
    arg5ptr = arg5;
	argcnt = 0;
    tempsPrivCount=0;
    tempsCount=0;
    setTempIdxActive=false;
    waitForFinishQueue=false;
    setMotorCharsActive=false;
    motorChars.startOnPower=50;
    fastQueueMode=false;
    stmStatus=STM_NOT_READY;
    getindex = 0;
    memset(cmd,0x0,sizeof(cmd));
    appState=APP_IDLE;
    timeout = 0;
    retry = 0;
    cnt_alive = COMM_ALIVE_CYCLE;
    appRetry=0;
    appTimeOuts=0;
    commstate=COMM_IDLE;
    matchSensorRequest=false;
    waitEEPFinished=false;
    stmInitState=STM_INIT_NOT_STARTED;
    fastGetOneWire=false;
}

void  CStmApp::app_setup() {
    UART_STM32.setRxBufferSize (2000);
    UART_STM32.begin(115200, SERIAL_8N1, STM32_RX, STM32_TX, false, 20000UL); 
    
    for (uint8_t x = 0;x<ACTUATOR_COUNT;x++) {
        actuators[x].actual_position = 100;
        actuators[x].target_position = 0;
        actuators[x].meancurrent = 342;
        actuators[x].state = VLV_STATE_START; //VLV_STATE_IDLE;
        actuators[x].temp1 = -500;
        actuators[x].temp2 = -500;
        actuators[x].tIdx1 = 0;
        actuators[x].tIdx2 = 0;
        actuators[x].lastState = actuators[x].state;
        actuators[x].worked = false;
   }

    for (uint8_t x = 0; x<ACTUATOR_COUNT; x++) {
        target_position_mirror[x] = actuators[x].target_position;
    }
    commstate=COMM_IDLE;
    #ifdef EnvDevelop
        UART_DBG.println("application setup finished");
    #endif
}

void  CStmApp::setupStartPosition(uint8_t thisStartPosition) 
{
    for (uint8_t x = 0;x<ACTUATOR_COUNT;x++) {
        actuators[x].target_position = thisStartPosition;
        target_position_mirror[x] = actuators[x].target_position;
    }
    #ifdef EnvDevelop
        UART_DBG.println("application setup start position finished");
    #endif
}


int16_t CStmApp::ConvertCF(int16_t cValue)
{
    if (VdmConfig.configFlash.systemConfig.celsiusFahrenheit==0) {
        return (cValue);
    } else {
        float F=((float) cValue)/10 * 1.8 + 32;
        return (int16_t(F*10+0.5));
    }
} 

int16_t CStmApp::getTOffset(uint8_t tIdx)
{
    int16_t result = 0;
    if (tIdx>0) {
        result = VdmConfig.configFlash.tempsConfig.tempConfig[tIdx].offset;
    } 
    return (result); 
}

bool CStmApp::checkNewTarget() {
    for (uint8_t i=0; i<ACTUATOR_COUNT; i++) {
        if (VdmConfig.configFlash.valvesConfig.valveConfig[i].active) {
            // check if target has changed
            if(target_position_mirror[i] != actuators[i].target_position) return (true);
        }
    }
    return (false);
}

void CStmApp::valvesCalibration()
{
    uint8_t i=255;
    app_cmd(APP_PRE_SETVLLEARN,String(i));
}

void CStmApp::valvesAssembly()
{
    app_cmd(APP_PRE_SETALLVLVOPEN, "255");
}

void CStmApp::valvesDetect()
{
    app_cmd(APP_PRE_SETDETECTVLV, "255");
}


void CStmApp::getParametersFromSTM()
{
    stmInitState=STM_INIT_STARTED;
    fastQueueMode=true;  
    app_cmd(APP_PRE_GETVERSION);
    app_cmd(APP_PRE_GETMOTCHARS);
    app_cmd(APP_PRE_GETLEARNMOVEM);
    app_cmd(APP_PRE_GETONEWIRECNT,String(255));
    app_cmd(APP_PRE_GETONEWIRESETT,String(255));
    app_cmd(APP_PRE_GETVLSTATUS);
    fastGetOneWire=true;
}

// soft reset of STM32 ensures that eeprom content is saved before restart
void CStmApp::softReset()
{   
    if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
        syslog.log(LOG_DEBUG, "stmApp: soft reset of STM32");
    }
    #ifdef EnvDevelop
        UART_DBG.println("stmApp: send soft reset command");
    #endif
    app_cmd(APP_PRE_SOFTRESET);
}

