Lenti84/VdMot_Controller/software_esp32/src/stmApp.cpp
                    if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                        syslog.log(LOG_DEBUG, "STMApp:got valve data #"+String(arg0ptr)+" pos:"+String(arg1ptr)+
                        " mean:"+String(arg2ptr)+" state:"+String(arg3ptr)+" t1:"+String(arg4ptr)+" t2:"+String(arg5ptr));
                    }

                    if (actuators[idx].state!=actuators[idx].lastState) {
                        switch (actuators[idx].state) {
                            case VLV_STATE_OPENING:
                            case VLV_STATE_CLOSING:
                            {
                                actuators[idx].worked = true;
                                break;    
                            }
                            case VLV_STATE_BLOCKS:
                            {
                                if (VdmConfig.configFlash.messengerConfig.reason.reasonFlags.valveBlocked) {
                                    String title = String(VdmConfig.configFlash.systemConfig.stationName) + " : Valve" ;
                                    String s = "Valve "+String(idx+1)+" is blocked";
                                    Messenger.sendMessage (title.c_str(),s.c_str());
                                }
                                break;
                            }
                            case VLV_STATE_OPENCIR:
                            {
                                if ((actuators[idx].worked) && (VdmConfig.configFlash.valvesConfig.valveConfig[idx].active)) { // has previous worked correctly
                                    if (VdmConfig.configFlash.messengerConfig.reason.reasonFlags.notDetect) {
                                        String title = String(VdmConfig.configFlash.systemConfig.stationName) + " : Valve" ;
                                        String s = "Valve "+String(idx+1)+" is not connected";
                                        Messenger.sendMessage (title.c_str(),s.c_str());
                                    }
                                }
                                break;
                            }
                        } 
                    }
                    actuators[idx].lastState=actuators[idx].state;
                }
            } 
            appState=APP_IDLE;
        }

        // get onewire data answer
		// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
        
        else if(memcmp(APP_PRE_GETONEWIRECNT,cmd,5) == 0) {
            if(argcnt == 1) {
                tempsPrivCount= atoi(arg0ptr); 
                if (tempsPrivCount!=tempsCount) app_cmd(APP_PRE_GETONEWIRECNT,String(255));
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                    syslog.log(LOG_DEBUG,"STMApp:one wire count "+String(tempsPrivCount));
                }       
            }
            if(argcnt == 2) {
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                    syslog.log(LOG_DEBUG,"STMApp:one wire data "+String(arg1ptr));
                } 
                tempsPrivCount= atoi(arg0ptr);
                if (tempsPrivCount>0) {
                    char* cmdptr;
                    char* ps=arg1ptr;
                    for (uint8_t idx=0; idx<tempsPrivCount;idx++) {
                        if ((cmdptr=strchr(ps,','))!=NULL) *cmdptr='\0';
                        strncpy(tempsId[idx].id,ps,sizeof(tempsId[idx].id));
                        ps=cmdptr+1;
                        idx++;
                    }
                }
                tempsCount=tempsPrivCount;
            }
            if (tempsPrivCount==0) fastGetOneWire=false;
            appState=APP_IDLE;
        }

		else if(memcmp(APP_PRE_GETONEWIREDATA,cmd,5) == 0) {
            if(argcnt == 2) {
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                    syslog.log(LOG_DEBUG,"STMApp:one wire data "+String(arg0ptr)+":"+String(arg1ptr));
                } 
                strncpy(tempsId[tempIndex].id,arg0ptr,sizeof(tempsId[tempIndex].id));

                int8_t idx=findTempID(arg0ptr);
                if (idx>=0) {
                    memset(temps[idx].id,0x0,sizeof(temps[idx].id)); 
                    strncpy(temps[idx].id,arg0ptr,sizeof(temps[idx].id));
                    int16_t cValue=atoi(arg1ptr);
                    temps[idx].temperature=ConvertCF(cValue)+VdmConfig.configFlash.tempsConfig.tempConfig[idx].offset;
                } 
                tempIndex++;
                
                if (tempIndex>=tempsCount) {  // all temp sensors read
                    tempIndex=0;
                    fastGetOneWire=false;
                }
                #ifdef AppDebug
                    UART_DBG.println("read onwire "+String(tempIndex)+":"+String(fastGetOneWire));
                #endif
            }
            // handle incomplete messages to not block 1-wire request cycle
            else if(argcnt == 1) {
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                    syslog.log(LOG_DEBUG,"STMApp:one wire data - only 1 arg");
                }
                tempIndex++;
                if (tempIndex>=tempsCount) {  // all temp sensors read
                    tempIndex=0;
                    fastGetOneWire=false;
                }
            }
            appState=APP_IDLE;
        }

        else if(memcmp(APP_PRE_GETVERSION,cmd,5) == 0) {
            if(argcnt > 0) {
                VdmSystem.stmVersion=arg0ptr; 
                VdmSystem.stmBuild=0;
            }
            if(argcnt > 1) {
                 VdmSystem.stmBuild=atoi(arg1ptr);
            }
            if (memcmp(cmd,(const void*) &cmd_buffer,5) ==0) cmd_buffer="";
            appState=APP_IDLE;
        }

        else if(memcmp(APP_PRE_GETONEWIRESETT,cmd,5) == 0) {
            if(argcnt == 3) {
                setSensorIndex(atoi(arg0ptr),arg1ptr,arg2ptr);
            }
            if(argcnt == 2) {
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                    syslog.log(LOG_DEBUG,"STMApp:one wire settings data "+String(arg0ptr)+" : "+String(arg1ptr));
                }   
                uint8_t nItems= atoi(arg0ptr);
                if (nItems>0) {
                    char* cmdptr;
                    char* ps=arg1ptr;
                    for (uint8_t idx=0; idx<nItems;idx++) {
                        if ((cmdptr=strchr(ps,','))!=NULL) *cmdptr='\0';
                        strncpy(arg4ptr,ps,sizeof(arg4));
                        if (cmdptr!=NULL) ps=cmdptr+1;
                        if ((cmdptr=strchr(ps,','))!=NULL) *cmdptr='\0';
                        strncpy(arg5ptr,ps,sizeof(arg5));
                        setSensorIndex(idx,arg4ptr,arg5ptr);
                        if (cmdptr!=NULL) ps=cmdptr+1;
                    }
                }
                
